src/pr14/conf/Documents/НачислениеЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>НачислениеЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.ОсновныеНачисления</xr:Item>
				<xr:Item>CalculationRegister.ДополнительныеНачисления</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодДействияНачало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодДействияКонец</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйПериодНачало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйПериодКонец</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>График</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Графики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйПериодНачало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйПериодКонец</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/pr14/conf/InformationRegisters/СведенияОСотрудниках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СведенияОСотрудниках</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/pr14/conf/Documents/НачислениеЗарплаты/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НаборОсновныеНачисления			 = Движения.ОсновныеНачисления;
	НаборДополнительныеНачисления	 = Движения.ДополнительныеНачисления;
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	СведенияОСотрудникахСрезПоследних.Период КАК Период,
		|	СведенияОСотрудникахСрезПоследних.Сотрудник КАК Сотрудник,
		|	СведенияОСотрудникахСрезПоследних.Оклад КАК Оклад
		|ПОМЕСТИТЬ втИзменениеОклада
		|ИЗ
		|	РегистрСведений.СведенияОСотрудниках.СрезПоследних(&ДатаНачала, ) КАК СведенияОСотрудникахСрезПоследних
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СведенияОСотрудниках.Период,
		|	СведенияОСотрудниках.Сотрудник,
		|	СведенияОСотрудниках.Оклад
		|ИЗ
		|	РегистрСведений.СведенияОСотрудниках КАК СведенияОСотрудниках
		|ГДЕ
		|	СведенияОСотрудниках.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
		|	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
		|	ВложенныйЗапрос.Подразделение КАК Подразделение,
		|	ВложенныйЗапрос.ВидРасчета КАК ВидРасчета,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.Период1 ЕСТЬ NULL
		|				ИЛИ ВложенныйЗапрос.Период1 < ВложенныйЗапрос.ПериодДействияНачало
		|			ТОГДА ВложенныйЗапрос.ПериодДействияНачало
		|		ИНАЧЕ ВложенныйЗапрос.Период1
		|	КОНЕЦ КАК ПериодДействияНачало,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.Период2 ЕСТЬ NULL
		|			ТОГДА КОНЕЦПЕРИОДА(ВложенныйЗапрос.ПериодДействияКонец, ДЕНЬ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВложенныйЗапрос.Период2, СЕКУНДА, -1)
		|	КОНЕЦ КАК ПериодДействияКонец,
		|	ВложенныйЗапрос.БазовыйПериодНачало КАК БазовыйПериодНачало,
		|	ВложенныйЗапрос.БазовыйПериодКонец КАК БазовыйПериодКонец,
		|	ВложенныйЗапрос.Размер КАК Размер,
		|	ВложенныйЗапрос.График КАК График
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОсновныеНачисления.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
		|		ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|		ОсновныеНачисления.Подразделение КАК Подразделение,
		|		ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|		ВЫБОР ОсновныеНачисления.ВидРасчета
		|			КОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисления.Оклад)
		|				ТОГДА втИзменениеОклада1.Оклад
		|			ИНАЧЕ ОсновныеНачисления.Размер
		|		КОНЕЦ КАК Размер,
		|		ОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|		КОНЕЦПЕРИОДА(ОсновныеНачисления.ПериодДействияКонец, ДЕНЬ) КАК ПериодДействияКонец,
		|		втИзменениеОклада1.Период КАК Период1,
		|		МИНИМУМ(втИзменениеОклада2.Период) КАК Период2,
		|		ОсновныеНачисления.БазовыйПериодНачало КАК БазовыйПериодНачало,
		|		ВЫБОР
		|			КОГДА ОсновныеНачисления.БазовыйПериодКонец <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА КОНЕЦПЕРИОДА(ОсновныеНачисления.БазовыйПериодКонец, ДЕНЬ)
		|			ИНАЧЕ ОсновныеНачисления.БазовыйПериодКонец
		|		КОНЕЦ КАК БазовыйПериодКонец,
		|		ОсновныеНачисления.График КАК График
		|	ИЗ
		|		Документ.НачислениеЗарплаты.ОсновныеНачисления КАК ОсновныеНачисления
		|			ЛЕВОЕ СОЕДИНЕНИЕ втИзменениеОклада КАК втИзменениеОклада1
		|			ПО ОсновныеНачисления.Сотрудник = втИзменениеОклада1.Сотрудник
		|				И (ОсновныеНачисления.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисления.Оклад))
		|			ЛЕВОЕ СОЕДИНЕНИЕ втИзменениеОклада КАК втИзменениеОклада2
		|			ПО (втИзменениеОклада1.Сотрудник = втИзменениеОклада2.Сотрудник)
		|				И (втИзменениеОклада1.Период < втИзменениеОклада2.Период)
		|	ГДЕ
		|		ОсновныеНачисления.Ссылка = &Ссылка
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ОсновныеНачисления.Ссылка.ПериодРегистрации,
		|		ОсновныеНачисления.Сотрудник,
		|		ОсновныеНачисления.Подразделение,
		|		ОсновныеНачисления.ВидРасчета,
		|		ОсновныеНачисления.ПериодДействияНачало,
		|		втИзменениеОклада1.Период,
		|		КОНЕЦПЕРИОДА(ОсновныеНачисления.ПериодДействияКонец, ДЕНЬ),
		|		ОсновныеНачисления.БазовыйПериодНачало,
		|		ВЫБОР
		|			КОГДА ОсновныеНачисления.БазовыйПериодКонец <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА КОНЕЦПЕРИОДА(ОсновныеНачисления.БазовыйПериодКонец, ДЕНЬ)
		|			ИНАЧЕ ОсновныеНачисления.БазовыйПериодКонец
		|		КОНЕЦ,
		|		ОсновныеНачисления.График,
		|		ВЫБОР ОсновныеНачисления.ВидРасчета
		|			КОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисления.Оклад)
		|				ТОГДА втИзменениеОклада1.Оклад
		|			ИНАЧЕ ОсновныеНачисления.Размер
		|		КОНЕЦ) КАК ВложенныйЗапрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник,
		|	Подразделение,
		|	ПериодДействияНачало
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Расчеты.ЗаполнитьНаборЗаписей(ТекстЗапроса, Ссылка, НаборОсновныеНачисления);
	НаборОсновныеНачисления.Записать(, Ложь);
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДополнительныеНачисления.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
		|	ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	ДополнительныеНачисления.Подразделение КАК Подразделение,
		|	ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
		|	ДополнительныеНачисления.БазовыйПериодНачало КАК БазовыйПериодНачало,
		|	ВЫБОР ДополнительныеНачисления.БазовыйПериодКонец
		|		КОГДА ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДополнительныеНачисления.БазовыйПериодКонец
		|		ИНАЧЕ КОНЕЦПЕРИОДА(ДополнительныеНачисления.БазовыйПериодКонец, ДЕНЬ)
		|	КОНЕЦ КАК БазовыйПериодКонец,
		|	ДополнительныеНачисления.Размер КАК Размер
		|ИЗ
		|	Документ.НачислениеЗарплаты.ДополнительныеНачисления КАК ДополнительныеНачисления
		|ГДЕ
		|	ДополнительныеНачисления.Ссылка = &Ссылка";
	
	Расчеты.ЗаполнитьНаборЗаписей(ТекстЗапроса, Ссылка, НаборДополнительныеНачисления);
	НаборДополнительныеНачисления.Записать(, Ложь);
	
	// Получение необходимых данных, расчёт и запись
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РассчитатьОсновныеНачисления(НаборОсновныеНачисления, Запрос);
КонецПроцедуры

Процедура РассчитатьОсновныеНачисления(НаборОсновныеНачисления, Запрос)
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ОсновныеНачисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
		|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК План,
		|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисления КАК ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(Регистратор = &Регистратор) КАК ОсновныеНачисленияДанныеГрафика
		|		ПО ОсновныеНачисления.НомерСтроки = ОсновныеНачисленияДанныеГрафика.НомерСтроки
		|ГДЕ
		|	ОсновныеНачисления.Регистратор = &Регистратор";
	
	Выборка = Запрос.Выполнить().Выбрать();

	Расчеты.РассчитатьЗаписиРегистраРасчета(НаборОсновныеНачисления, Выборка);
	НаборОсновныеНачисления.Записать(, Истина);
КонецПроцедуры
